app/controllers/ebooks_controller.rb

  def index
    @ebooks = Ebook.all
---
SELECT "ebooks".* FROM "ebooks"