app/controllers/registers_controller.rb

  def index
    @registers = Register.all
---
SELECT "registers".* FROM "registers"

  def create
    @register = Register.new(register_params)

    respond_to do |format|
      if @register.save
---
INSERT INTO "registers" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["email", ""], ["password", ""], ["created_at", "2016-11-07 22:00:15.688405"], ["updated_at", "2016-11-07 22:00:15.688405"]]

    def set_register
      @register = Register.find(params[:id])
---
SELECT  "registers".* FROM "registers" WHERE "registers"."id" = ? LIMIT 1  [["id", 1]]